### [DataFrame의 인덱스 다루기 - 2]
- 새로운 행 인덱스를 생성 및 적용
- 메서드 : 변수명.reindex(새로운 인덱스, fill_value)

In [2]:
# [1] 모듈 호출
import pandas as pd

In [3]:
# [2] Data 준비
jumsu = {"name" : ["마징가", "태권V", "원더우먼"],
         "kor" : [89, 80, 78],
         "eng" : [75, 75, 76],
         "math" : [78, 80, 82]}

In [4]:
# [3] Dict ==> DataFrame 형태로 변환
jumsuDF = pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   89   75    78
1   태권V   80   75    80
2  원더우먼   78   76    82

In [10]:
# [3] 행 인덱스를 새롭게 생성
new_index = ["r0", "r1", "r2"]

DF2 = jumsuDF.reindex(new_index)
DF2

    name  kor  eng  math
r0   마징가   89   75    78
r1   태권V   80   75    80
r2  원더우먼   78   76    82

In [7]:
new_index = [0, 1, 2, "r0", "r1", "r2"] # 0, 1, 2 인덱스에 대응하는 값들은 모두 들어감 r0, r1, r2의 해당하는 값들은 없어서 비어서 들어감

DF2 = jumsuDF.reindex(new_index)
DF2

    name   kor   eng  math
0    마징가  89.0  75.0  78.0
1    태권V  80.0  75.0  80.0
2   원더우먼  78.0  76.0  82.0
r0   NaN   NaN   NaN   NaN
r1   NaN   NaN   NaN   NaN
r2   NaN   NaN   NaN   NaN

In [8]:
# [5] 행 인덱스를 새롭게 생성 => 존재하지 않는 행에 값 설정
DF3 = jumsuDF.reindex([0, "r0", "r1", 2], fill_value = 0) # 새로생긴 행 인덱스에 대해서 값 지정
DF3

    name  kor  eng  math
0    마징가   89   75    78
r0     0    0    0     0
r1     0    0    0     0
2   원더우먼   78   76    82